manual/manual.org
#+TITLE: ExaBayes User's Manual
#+AUTHOR: 
* Quick Start
* Installation
  After downloading the software package (e.g., exabayes-0.4.tar.gz),
  you will have to compile the source code. The following sections
  explain, how to do so. After compiling you obtain an executable
  called exabayes.    
** Requirements 
   ExaBayes requires a relatively recent c/c++ compiler that supports
   c++11 features. ExaBayes is confirmed to work with
   1. GCC version 4.6 or greater 
   2. Clang version 3.2 or greater
      
   For running ExaBayes, you need 
      

** Comfort build 
   The preferred way of compiling ExaBayes is to use the small
   *build.sh* script. If you need to have more control over the build
   process, consider the next two sections.

   Simple execution of the build script creates the sequential version
   of ExaBayes (called Yggdrasil) and all pre- and post-processing
   tools in a build-folder.

#+BEGIN_SRC sh
  $ ./build.sh 
   [...] 
  $ ls build 
  asdsf  consense  credibleSet extractBips  obj-mpi  obj-seq  parser  postProcParam  yggdrasil
#+END_SRC
   
   For building the (parallel) mpi-version of ExaBayes (executable is
   called exabayes), please provide the name of the mpi-C compiler
   (usually mpicc) and mpi-C++ compiler (mpicxx,mpiCC or mpic++) as
   environment variable arguments. For instance: 

#+BEGIN_SRC sh
  $ ./build.sh CC=mpicc CXX=mpic++
  [...]
  $ ls build 
  exabayes
#+END_SRC

** Manual: Compiling the Sequential Version 
   To compile a sequential version of ExaBayes (called yggdrasil) and
   various pre- and post-processing tools, type
   #+BEGIN_SRC sh 
$ ./configure && make 
   #+END_SRC  
   If you have a multi-core machine, you can speed up the build
   process by adding -j<numProc> to the make command.
** Manual: Compiling the Parallel Version 
   For compiling the parallel mpi-version using the configure script,
   employ the command line below.

   You have to use a slightly different configure call and inform the
   configure script about your mpi compiler wrapper. These are usually
   called mpicc (c compiler) and mpicxx/mpiCC or mpic++ (c++
   compiler). For instance:
   #+BEGIN_SRC sh
$ ./configure --enable-mpi CC=mpicc CXX mpicxx  && make 
   #+END_SRC
   
* Command Line Options Explained
  The syntax for starting ExaBayes is as follows:
   #+BEGIN_SRC sh
  ./exabayes   -f alnFile [ -q modelFile ] [ -m model ] [ -s seed | -r id ]  -n id [options..] 
   #+END_SRC


   #+BEGIN_SRC sh
  Mandatory Arguments: 
    -f alnFile       an alignment file (either binary and created by parser or plain-text phylip)
    -s seed          a master seed for the MCMC
    -n ruid          a run id
    -r id            restart from checkpoint. Just specify the id of the previous run (-n) here. 
                       Make sure, that all files created by the previous run are in the working directory.
                       This option is not mandatory for the start-up, seed (via -s) will be ignored.
     -q modelfile     a RAxML-style model file (see manual) for multi-partition alignments. Not needed 
                       with binary files.
     -m model         indicates the type of data for a single partition non-binary alignment file
                       (valid values: DNA or PROT)


  Options:
    -v               print version and quit
    -h               print this help
    -d               execute a dry-run. Procesess the input, but does not execute any sampling.
    -c confFile      a file configuring your ExaBayes run. For a template see the examples/ folder
    -w dir           specify a working directory for output files
    -R num           the number of runs (i.e., independent chains) to be executed in parallel
    -C num           number of chains (i.e., coupled chains) to be executed in parallel
    -Q               per-partition data distribution (use this only with many partitions, check manual
                       for detailed explanation)
    -S               try to save memory using the SEV-technique for gap columns on large gappy alignments
                       Please refer to  http://www.biomedcentral.com/1471-2105/12/470
                       On very gappy alignments this option yields considerable runtime improvements. 
    -M mode          specifies the memory versus runtime trade (see manual for detailed discussion).
                       <mode> is a value between 0 (fastest, highest memory consumption) and 3 (slowest,
                       least memory consumption)
   #+END_SRC

** Mandatory Arguments
   #+BEGIN_SRC sh
      -f alnFile       
   #+END_SRC
  Specifies an alignment file, either a binary created by the parser or a plain-text phylip. A plain text phylip file requires either a model file or a model definition. These two are given by the following arguments:
  
  #+BEGIN_SRC sh
     -m model 
     -q modelfile         
   #+END_SRC

  The model must either be DNA (for dna data) or PROT (for protein data) and is only usable for a single partition alignment.
  The modelfile must define all partitions and give their data types in the following form: 

  #+BEGIN_SRC sh
   DNA, gene1=1-300
   PROT, gene3=301-1100
   ....
   DNA, geneN=7601-8149      
   #+END_SRC
  For a binary alignment file neither of the options is needed.

  #+BEGIN_SRC sh
      -n ruid  
      -r id 
   #+END_SRC
  Each ExaBayes run must be assignmed its unique id via this argument.
  When restarting a run from a checkpoint, the original id must be given with -r and a new unique id must be assignemd with -n.

