manual/manual.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>ExaBayes User's Manual</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-15 21:24:43 CET"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">ExaBayes User's Manual</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Quick Start </a></li>
<li><a href="#sec-2">2 Installation </a>
<ul>
<li><a href="#sec-2.1">2.1 Requirements </a></li>
<li><a href="#sec-2.2">2.2 Comfort build </a></li>
<li><a href="#sec-2.3">2.3 Manual: Compiling the Sequential Version </a></li>
<li><a href="#sec-2.4">2.4 Manual: Compiling the Parallel Version </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Command Line Options Explained </a>
<ul>
<li><a href="#sec-3.1">3.1 Mandatory Arguments </a></li>
</ul>
</li>
<li><a href="#sec-4">4 The Configuration File </a>
<ul>
<li><a href="#sec-4.1">4.1 Parameter Linkage </a></li>
<li><a href="#sec-4.2">4.2 Priors </a></li>
<li><a href="#sec-4.3">4.3 General Settings </a></li>
<li><a href="#sec-4.4">4.4 Proposals </a></li>
</ul>
</li>
<li><a href="#sec-5">5 On Bayesian Analyses </a></li>
<li><a href="#sec-6">6 ExaBayes at Large: Invocations on Clusters/Supercomputers </a></li>
<li><a href="#sec-7">7 Notes on Reproducibility </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Quick Start </h2>
<div class="outline-text-2" id="text-1">

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Installation </h2>
<div class="outline-text-2" id="text-2">

<p>After downloading the software package (e.g., exabayes-0.4.tar.gz),
you will have to compile the source code. The following sections
explain, how to do so. After compiling you obtain an executable
called exabayes.    
</p>
</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Requirements </h3>
<div class="outline-text-3" id="text-2.1">

<p>ExaBayes requires a relatively recent c/c++ compiler that supports
c++11 features. ExaBayes is confirmed to work with
</p><ol>
<li>
GCC version 4.6 or greater 
</li>
<li>
Clang version 3.2 or greater

</li>
</ol>

<p>For running ExaBayes, you need 
</p>

</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> Comfort build </h3>
<div class="outline-text-3" id="text-2.2">

<p>The preferred way of compiling ExaBayes is to use the small
<b>build.sh</b> script. If you need to have more control over the build
process, consider the next two sections.
</p>
<p>
Simple execution of the build script creates the sequential version
of ExaBayes (called Yggdrasil) and all pre- and post-processing
tools in a build-folder.
</p>



<pre class="example">$ ./build.sh 
 [...] 
$ ls build 
asdsf  consense  credibleSet extractBips  obj-mpi  obj-seq  parser  postProcParam  yggdrasil
</pre>




<p>
For building the (parallel) mpi-version of ExaBayes (executable is
called exabayes), please provide the name of the mpi-C compiler
(usually mpicc) and mpi-C++ compiler (mpicxx,mpiCC or mpic++) as
environment variable arguments. For instance: 
</p>



<pre class="example">$ ./build.sh CC=mpicc CXX=mpic++
[...]
$ ls build 
exabayes
</pre>




</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> Manual: Compiling the Sequential Version </h3>
<div class="outline-text-3" id="text-2.3">

<p>To compile a sequential version of ExaBayes (called yggdrasil) and
various pre- and post-processing tools, type
</p>


<pre class="example">$ ./configure &amp;&amp; make 
</pre>



<p>
If you have a multi-core machine, you can speed up the build
process by adding -j&lt;numProc&gt; to the make command.
</p></div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> Manual: Compiling the Parallel Version </h3>
<div class="outline-text-3" id="text-2.4">

<p>For compiling the parallel mpi-version using the configure script,
employ the command line below.
</p>
<p>
You have to use a slightly different configure call and inform the
configure script about your mpi compiler wrapper. These are usually
called mpicc (c compiler) and mpicxx/mpiCC or mpic++ (c++
compiler). For instance:
</p>


<pre class="example">$ ./configure --enable-mpi CC=mpicc CXX mpicxx  &amp;&amp; make 
</pre>




</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Command Line Options Explained </h2>
<div class="outline-text-2" id="text-3">

<p>The syntax for starting ExaBayes is as follows:
</p>


<pre class="example">./exabayes   -f alnFile [ -q modelFile ] [ -m model ] [ -s seed | -r id ]  -n id [options..] 
</pre>






<pre class="example">Mandatory Arguments: 
  -f alnFile       an alignment file (either binary and created by parser or plain-text phylip)
  -s seed          a master seed for the MCMC
  -n ruid          a run id
  -r id            restart from checkpoint. Just specify the id of the previous run (-n) here. 
                     Make sure, that all files created by the previous run are in the working directory.
                     This option is not mandatory for the start-up, seed (via -s) will be ignored.
   -q modelfile     a RAxML-style model file (see manual) for multi-partition alignments. Not needed 
                     with binary files.
   -m model         indicates the type of data for a single partition non-binary alignment file
                     (valid values: DNA or PROT)


Options:
  -v               print version and quit
  -h               print this help
  -d               execute a dry-run. Procesess the input, but does not execute any sampling.
  -c confFile      a file configuring your ExaBayes run. For a template see the examples/ folder
  -w dir           specify a working directory for output files
  -R num           the number of runs (i.e., independent chains) to be executed in parallel
  -C num           number of chains (i.e., coupled chains) to be executed in parallel
  -Q               per-partition data distribution (use this only with many partitions, check manual
                     for detailed explanation)
  -S               try to save memory using the SEV-technique for gap columns on large gappy alignments
                     Please refer to  http://www.biomedcentral.com/1471-2105/12/470
                     On very gappy alignments this option yields considerable runtime improvements. 
  -M mode          specifies the memory versus runtime trade (see manual for detailed discussion).
                     &lt;mode&gt; is a value between 0 (fastest, highest memory consumption) and 3 (slowest,
                     least memory consumption)
</pre>





</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> Mandatory Arguments </h3>
<div class="outline-text-3" id="text-3.1">




<pre class="example">-f alnFile       
</pre>



<p>
Specifies an alignment file, either a binary created by the parser or a plain-text phylip. A plain text phylip file requires either a model file or a model definition. These two are given by the following arguments:
</p>



<pre class="example">-m model 
-q modelfile         
</pre>




<p>
The model must either be DNA (for dna data) or PROT (for protein data) and is only usable for a single partition alignment.
The modelfile must define all partitions and give their data types in the following form: 
</p>



<pre class="example">DNA, gene1=1-300
PROT, gene3=301-1100
....
DNA, geneN=7601-8149      
</pre>



<p>
For a binary alignment file neither of the options is needed.
</p>



<pre class="example">-n ruid  
-r id 
</pre>



<p>
Each ExaBayes run must be assignmed its unique id via this argument.
When restarting a run from a checkpoint, the original id must be given with -r and a new unique id must be assignemd with -n.
</p>
</div>
</div>

</div>
