manual/manual.org
* The Configuration File 

Most of the advanced options, settings for priors and proposal frequencies can be set in a NEXUS config file. Such a file is passed with the -c argument. If no config file is specified, default values are used.

The basic setup of such a config file is as follows:
  #+BEGIN_SRC sh

#NEXUS [Each config file must start with this header]

[Note that any text enclosed in "[ ]" is ignored by ExaBayes.]
[Please do not use scientific notation for numbers (e.g., 1e-6).] 

[================================================================]
[ LINKING of parameters across partitions ]
[================================================================]
begin params; 

[Here we define how and if parameters are linked across partitions.]

end;  


[================================================================]
[ PRIOR configuration ]
[================================================================]
begin PRIOR; 

[The priors are defined in this block.]

end; 

[================================================================]
[                               GENERAL                          ] 
[================================================================]
begin runconfig; 

[General settings about the run and chain configuration go here.]

end; 

[================================================================]
[ PROPOSAL configuration ]
[================================================================]

begin proposals; 

[List of proposal frequencies and advanced options.]

end ; 
   #+END_SRC

** Parameter Linkage
  Parameters, such as model of evolution or branch lengths can be linked across partitions. Two partitions that are linked with respect to a parameter always have the same parameter assigned to them. Notice that everything (except branch lengths) is unlinked by default.
  An examplary code block, for an alignment with 4 partitions, in the config file looks as follows:
  #+BEGIN_SRC sh
[================================================================]
[ LINKING of parameters across partitions ]
[================================================================]
 begin params; 

brlens = (0+1+2+3)  [ Links branch lengths across all 4 partitions ]
stateFreq = (0+1,2,3)     [ <= 0,1 are linked, we have separate state frequency parameters for 2 and 3 ]
rateHet = (0,2+1,3)  [ <= 1,2 are linked, we have separate rate heterogeneity parameters for 0 and 3 ]
revMat = (0,1,2,3)   [ Keeps the  revMat parameter unlinked (default state)]
 

end;  
   #+END_SRC

** Priors
Priors can, with a few exceptions, be either fixed, to take a constant value, be uniformly, exponentially or dirichlet distributed. Priors can be defined as a default for all partitions or on a per partition basis.

  #+BEGIN_SRC sh
[================================================================]
[ PRIOR configuration ]
[================================================================]
begin PRIOR; 
[ topology: ]
[ topoPr fixed() ] [Must provide a starting tree] 
topoPr uniform(0,1) [Uniform prior]


[ branch lengths: ]
[ brlenpr uniform(0.0000001,4)   ] [Uniform between 0.0000001 and 4] 
[ brlenpr fixed() ] [ Needs a user tree with branch lengths. Only aplicable in conjunction with a fixed topology. ]  
[ brlenpr exponential(10) ] [Exponential prior with lambda=10]
  brlenpr{3} exponential(10.0) [Sets the prior for partition 3 only (!). All others use default values.] 


[ substitution matrix ]
  revMatPr dirichlet(2,1,1,1,1,1) [Sets the prior to dirichlet D(2,1,1,1,1,1) (6 values for a DNA substitution matrix)]
[ revMatPr fixed(2,1,1,1,1,1) ] [Sets the revMat parameter to a constant (2,1,1,1,1,1)]


[ state frequencies ] 
[  stateFreqPr{0}  dirichlet(0.25,0.25,0.25,0.25)  ]  [Sets the prior for partition 0 (!) to dirichlet D(0.25,0.25,0.25,0.25) (4 values for a DNA)]
[  stateFreqPr fixed(0.25,0.25,0.25,0.25) ] [Sets the state frequencies to a constant (0.25,0.25,0.25,0.25)] 

[ rate heterogeneity: alpha parameter ]
[ shapePr exponential(1) ]
[ shapePr uniform(0.0000001,200) ] 
[ shapePr fixed(1) ] 

[ models for amino acid partitions: ] 
 aaPr disc( WAG=3 , JTT=2 ) [Sets the prior for all amino acid partitions to 0.6 WAG and 0.4 JTT. All models implemented in RAxML may be used here. When the discrete prior is enabled for a partition, the revMat prior (and proposal) is deactivated.] 
[ aaPr disc( WAG=3 , JTT=2 , REMAINDER=1 ) ] [Sets the weight for all unmentioned models to 1 and for WAG to 3 and JTT to 2.]
[ aaPr fixed(WAG) ] [Always choose the WAG model]

end; 

   #+END_SRC


** General Settings

Most settings for the run and chain configuration are also defined in the config file.
  #+BEGIN_SRC sh
[================================================================]
[                               GENERAL                          ] 
[================================================================]
begin runconfig; 

 [ RUN PARAMETERS ]
 diagFreq 5000		[ check for convergence of multiple independent runs after this many generations ]
 samplingFrequency 500 	[ take a sample every n generations ]
 numRuns  2 	   	[ number of independant runs ]
 numGen 100000          [ if numRuns = 1, stop simulation after that many generations ] 
 tuneFreq 100 		[ tune move parameters every n generations, set to 0, if you want to disable parameter tuning ] 
 printFreq 1000		[ print a sample to the screen every n generations, set to 0 if you want to disable output info about the state of the chains  ]

  parsimonyStartingTree		true		[ allowed values: true  / false(default); if no starting tree is present, a random tree is used   ] 
  heatedChainsUseSame		false		[ should heated chains start with the same tree as the cold chain? default: false] 
  [  sampledHeated false ] [ also take samples from the heated chains ]

 checkPointInterval   1000  [ defines how often a checkpoint is written ]

 [ CONVERGENCE ]
 asdsfIgnoreFreq  0.1	[ ignore clades for which the relative  frequency in no chain exceeds this value ]
 asdsfConvergence  0.005    [ indicate convergence, as soon as the asdsf is below this value: 1-5% is considered good, 0.005 can be considered very good convergence ] 


 [ MCMCMC ]
 numCoupledChains  2	[ number of chains per independent run (only one is cold)  => must be > 0] 
 heatFactor 0.1   	[ the heat increment added to each hotter chain (this is not the inverse heat)   ]
 swapInterval 1 	[ attempt a swap between chains every n generations ]
 numSwaps     1         [  number of swaps to attempt between coupled chains for the swap interval ] 


 [ BURNIN ] 
 [ comment out one of the two options ]      
 [ burninGen 2000 ]     [ exact number of generations that are discarded for diagnostics ]  
  burninProportion 	  	0.25   	  	[ discard this proportion of all initial samples as burnin  ]


end; 
 #+END_SRC

